Repository: Tawasoulmohamedkhair/online_learning_design
Catalog: lib/l10n/intl_*.arb
Languages: ar

# name
source: Flutter Localization
ar: فلاتر لوكاليزيشن

source: About this course
ar: حول هذه الدورة

source: Account
ar: الحساب

source: All
ar: الكل

source: An unexpected error occurred,
ar: !حدث خطأ غير متوقع،

source: Apply Filter
ar: تطبيق الفلاتر

source: Already have an account？
ar: لديك حساب؟

source: Balance
ar: الرصيد

source: Buy Now
ar: اشترِ الآن

source: By creating an account you have to agree with our them & condication.
ar: بإنشاء حساب، يجب أن توافق على الشروط والأحكام الخاصة بنا

source: Categories
ar: الفئات

source: Clear
ar: مسح

source: Coding
ar: البرمجة

# codeSent
source: Code is sent to {phoneNumber}
ar: تم إرسال الرمز إلى {phoneNumber}

source: Confirm Password
ar: تأكيد كلمة المرور

source: Choice your course
ar: اختر دورتك

source: Clocking in!
ar: !تسجيل الحضور

source: Completed
ar: مكتمل

# congratulationskeepupthegoodwork
source: Congratulations on completing the first lesson, keep up the good work!
ar: !تهانينا على إكمال الدرس الأول، استمر في العمل الجيد

# congratulationsstartyourlearningjourneynext
source: Congratulations, you have completed your registration! Lets start your learning journey next.
ar: .تهانينا، لقد أكملت تسجيلك بنجاح! لنبدأ رحلتك التعليمية الآن

source: Congratulations on completing the ...
ar: .تهانينا على إكمال

source: Congratulations, you have ...
ar: ...تهانينا، لقد

# continues
source: Continue
ar: متابعة

source: Continue with Phone
ar: متابعة بواسطة الهاتف

# course
source: Courses
ar: الدورات

source: Creat account
ar: إنشاء حساب

source: Create your own study plan
ar: إنشاء خطة تعلمك الخاصة

# easyandfastlearning
source: Easy and fast learning at any time to help you improve various skills
ar: سهولة وسرعة في التعلم في أي وقت لمساعدتك في تحسين مجموعة من المهارات

source: Edit Account
ar: تعديل الحساب

# enteravalidemailaddress
source: Please enter a valid email address
ar: ادخل عنوان بريد إلكتروني صالح

source: Enter your details below & free sign up
ar: أدخل تفاصيلك أدناه لإنشاء حساب مجاني

source: Enter Your Phone Number
ar: ادخل رقم هاتفك

source: days
ar: الايام

source: Discovery
ar: الاكتشاف

source: Didn’t recieve code? Request again
ar: لم تستلم الرمز؟ طلب مرة أخرى

source: Done
ar: تم

source: Don’t have an account?
ar: لا تمتلك حساب؟

# donthaveanyproducts
source: You dont have any products yet!
ar: !ليس لديك أي منتجات بعد

source: Duration
ar: المدة

source: Favourite
ar: المفضلة

source: Find Cousre
ar: ابحث عن دورة

source: Forget password?
ar: نسيت كلمة المرور؟

# freecourses
source: Free courses for you to find your way to learning
ar: دورات مجانية للوصول إلى طريقتك للتعلم

source: Get Started
ar: ابدأ

source: GOOD JOB!
ar: !أحسنت

source: Help
ar: المساعده

# hiUser
source: Hi, {userName}
ar: مرحباً، {userName}

source: Home
ar: الرئيسية

# hours
source: 16 hours
ar: 16 ساعة

# hours14
source: 14 hours
ar: 14 ساعة

# Hours3to8
source: 3-8 Hours
ar: 3-8 ساعات

# Hours8to14
source: 8-14 Hours
ar: 8-14 ساعات

# Hours14to20
source: 14-20 Hours
ar: 14-20 ساعات

# Hours20to24
source: 20-24 Hours
ar: 20-24 ساعات

# Hours24to30
source: 24-30 Hours
ar: 24-30 ساعات

source: Java Development
ar: تطوير جافا

source: Just now
ar: الآن فقط

# language
source: LanguageSetting
ar: ضبط اللغة

# message
source: Messages
ar: الرسائل

source: Learning Plan
ar: خطة التعلم

# Lessons
source: 6h 14min · 24 Lessons
ar: درسًا

source: Let’s start learning
ar: لنبدأ التعلم

source: Learned today
ar: تعلمت اليوم

source: Login successful!
ar: تم تسجيل الدخول بنجاح!

source: Mathmatics
ar: الرياضيات

source: Meetup
ar: اجتماع

# min
source: 46min
ar: 46 دقيقة

# min46
source: 46min/60min
ar: 46 دقيقة/60 دقيقة

source: more
ar: المزيد

source: My card
ar: بطاقتي

source: My courses
ar: الدورات الخاصة بي

source: Music
ar: الموسيقى

source: New
ar: جديد

source: No Network!
ar: !لا يوجد اتصال بالشبكة

source: No Notifictations yet!
ar: !لا توجد إشعارات حتى الآن

source: No products
ar: لا توجد منتجات

source: No videos!
ar: !لا توجد فيديوهات

# novideo
source: Here is no video you want at the moment
ar: لا يوجد الفيديو الذي تريده في الوقت الحالي

# checkyourinternetconnection
source: Please check your internet connection and try again
ar: يرجى التحقق من اتصالك بالإنترنت والمحاولة مرة أخرى

source: Notifications
ar: الإشعارات

source: notification
ar: الإشعارات

source: Numerous free trial courses
ar: كثير من الدورات المجانية

source: Offline
ar: غير متصل

source: Off-line exchange of learning experiences
ar: تبادل الخبرات التعليمية خارج الإنترنت

source: Online
ar: متصل

source: Or login with
ar: أو تسجيل الدخول بواسطة

source: Packaging Design
ar: تصميم التعبئة

source: Price
ar: السعر

source: processoverview
ar: نظرة عامة على العملية

source: Product Design
ar: تصميم المنتج

source: Painting
ar: الرسم

source: Password
ar: كلمة المرور

source: Passwords do not match
ar: كلمات المرور لا تتطابق

source: Payment Password
ar: كلمة مرور الدفع

source: Pay Now
ar: ادفع الآن

source: phoneNumber
ar: رقم الهاتف

source: Please enter the payment password
ar: أدخل كلمة مرور الدفع من فضلك

source: Please enter your email
ar: يرجى إدخال البريد الالكتروني

source: Please enter your password
ar: يرجى إدخال كلمة المرور

source: popular
ar: المفضل

source: Product Design v1.0
ar: تصميم المنتج الإصدار 1.0

source: Processing Sign Up...
ar: معالجة التسجيل...

source: Quick and easy learning
ar: سرعة وسهولة في التعلم

source: Record of this week
ar: سجل هذا الأسبوع

source: Results
ar: النتائج

source: Search
ar: البحث

source: Search Filter
ar: خيارات البحث

source: Search more
ar: ابحث عن المزيد

source: Settings and Privacy
ar: الإعدادات والخصوصية

source: Share
ar: مشاركة

# sign_in
source: Login
ar: تسجيل الدخول

source: Sign Up
ar: التسجيل

source: Sign up successful!
ar: تم التسجيل بنجاح!

source: Skip
ar: تخطي

source: Start learning
ar: ابدأ التعلم

# studyaccordingtothestudyplan
source: Study according to the study plan, make study more motivated
ar: ذاكر وفقًا لخطة الدراسة، واجعل المذاكرة أكثر تحفيزًا

source: Success
ar: تم بنجاح

source: Successful purchase!
ar: !تم الشراء بنجاح

source: Totally days
ar: مجموع الايام

source: totally hours
ar: مجموع الساعات

source: Try again
ar: حاول مرة اخرى

source: Verify and Create Account
ar: تحقق وإنشاء حساب

source: Verify Phone
ar: تحقق من الهاتف

source: Visual Design
ar: التصميم المرئي

source: Visual identiy
ar: الهوية البصرية

source: Your Email
ar: البريد الالكتروني

# youhavecompletedyourregistration
source: Congratulations, you have completed your registration!
ar: تهانينا، لقد أكملت تسجيلك!

source: Welcome to the Course
ar: مرحبًا بك في الدورة

source: We’ll notify you once we have something for you
ar: سنخبرك عندما يتوفر لدينا شيء لك

source: What do youwant to learn today ?
ar: ماذا تريد أن تتعلم اليوم؟

source: Your course has been updated, you ...
ar: ...تم تحديث دورتك، لقد

# yourcoursehasbeenupdatedcheckthenewcourse
source: Your course has been updated, you can check the new course in your study course.
ar: .تم تحديث دورتك التدريبية، يمكنك الاطلاع على الدورة الجديدة في صفحة المقررات الدراسية
